Revit 2024 API
SunStudyTimeInterval Enumeration
 Time interval enum for a single or multi-day sun study.
 Enum of sun study time interval.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Since: 2011
Syntax
C#
public enum SunStudyTimeInterval
Visual Basic
Public Enumeration SunStudyTimeInterval
Visual C++
public enum class SunStudyTimeInterval
Members
Member name | Description
Seconds15 |  Interval occurs every 15 seconds.
Seconds30 |  Interval occurs every 30 seconds.
Seconds45 |  Interval occurs every 45 seconds.
Minute |  Interval occurs every minute.
Minutes15 |  Interval occurs every 15 minutes.
Minutes30 |  Interval occurs every 30 minutes.
Minutes45 |  Interval occurs every 45 minutes.
Hour |  Interval occurs every hour.
Day |  Interval occurs every day.
Week |  Interval occurs once a week.
Month |  Interval occurs once a month.
See Also
Autodesk.Revit.DB Namespace